{
    "jobs": [
        {
            "title": "Snapp - Senior Software Engineer, iOS",
            "location": "Tehran, Iran (Remote)",
            "dates": "09/2024 - Current",
            "tasks": [
                "Design a roadmap on how to avoid negative impact of code changes across 2 shared products, each supporting 2 distinct projects.",
                "Supervise chapter-wide <strong>testing</strong> strategy deployment and <strong>mentor</strong> 20 engineers by <strong>hosting workshops</strong> and 1o1 troubleshooting.",
                "Consult architectural refinements.",
                "Refactor and implement <strong>integration tests</strong> on internal frameworks.",
                "Implement face recognition and accessibility features utilizing <strong>Vision Framework</strong> following <strong>VIPER</strong> in composition with <strong>micro-services</strong>."
            ],
            "appstore": [
                {
                    "app": "Snapp Passenger",
                    "link": "https://apps.apple.com/us/app/%D8%A7%D8%B3%D9%86%D9%BE-%D8%AA%D8%A7%DA%A9%D8%B3%DB%8C-%D8%BA%D8%B0%D8%A7-%D8%B3%D9%88%D9%BE%D8%B1%D9%85%D8%A7%D8%B1%DA%A9%D8%AA/id996370173",
                    "rating": 4.5
                },
                {
                    "app": "Snapp Driver",
                    "link": "https://apps.apple.com/us/app/%D8%A7%D8%B3%D9%86%D9%BE-%D8%B1%D8%A7%D9%86%D9%86%D8%AF%DA%AF%D8%A7%D9%86-snapp-driver/id6449247898",
                    "rating": 3.6
                },
                {
                    "app": "Baly Passenger",
                    "link": "https://apps.apple.com/us/app/baly-%D8%A8%D9%84%D9%8A/id1590560595",
                    "rating": 4.0
                },
                {
                    "app": "Baly Driver",
                    "link": "https://apps.apple.com/us/app/%D8%AA%D8%B7%D8%A8%D9%8A%D9%82-%D8%A7%D9%84%D9%86%D9%82%D9%84-%D8%A8%D9%84%D9%8A-%D9%83%D8%A7%D8%A8%D8%AA%D9%86/id1605807171",
                    "rating": 3
                }
            ]
        },
        {
            "title": "Namava - Senior iOS Engineer",
            "location": "Tehran, Iran (Remote)",
            "dates": "11/2022 - 09/2024",
            "tasks": [
                "Designed and deployed <strong>12 iOS SDKs</strong>, implementing <strong>Clean Architecture</strong> principles to ensure modularity and scalability. These SDKs are now a cornerstone of our mobile apps, used across two projects.",
                "Architected a modular design with clear APIs, enabling colleagues to develop features with less code and greater reliability. This approach was driven by the principles of <strong>SAP (Stable Abstraction Principle)</strong> , <strong>CCP (Common Closure Principle)</strong> , and <strong>CRP (Common Reuse Principle)</strong>.",
                "Implemented a custom <strong>Video Player</strong> within the new modular design, wrapping AVPlayer. This player has been highly praised for its performance and reliability, surpassing our Android and Web platforms.",
                "Led the rewrite of the project using <strong>SwiftUI</strong> and <strong>Combine</strong>, transitioning from <strong>UIKit</strong> and <strong>RxSwift</strong>, and adding support for iPad. This rewrite emphasized software stability.",
                "Applied <strong>SOLID principles</strong> and <strong>Protocol-Oriented Programming</strong> to design a flexible and maintainable codebase, following <strong>Clean Code</strong> practices to improve readability and reduce complexity.",
                "Utilized <strong>TDD (Test-Driven Development)</strong> to enforce high-quality code standards, resulting in a significant reduction in bugs and ensuring the delivery of reliable and flawless features.",
                "Emphasized <strong>DRY (Don't Repeat Yourself)</strong> and <strong>KISS (Keep It Simple, Stupid)</strong> principles in code reviews and development practices, leading to cleaner and more efficient code.",
                "Conducted technical interviews as part of a two-step hiring process, including knowledge-based assessments and live coding or home assignments, contributing to the successful hiring of two iOS engineers.",
                "Deployed primitive <strong>CI/CD</strong> using <strong>Fastlane</strong> and <strong>GitLab CI</strong>, ensuring sufficient test coverage and seamless releases."
            ],
            "appstore": []
        },
        {
            "title": "StrAIberry - iOS Engineer",
            "location": "Vancouver, Canada (Remote)",
            "dates": "10/2020 - 11/2022",
            "tasks": [
                "Followed the <strong>MVVM-C</strong> architectural pattern to ensure clean and maintainable code, supported by end-to-end tests to validate functionality.",
                "Developed and integrated advanced features such as <strong>object detection</strong> and target image capture using <strong>Vision framework</strong>, <strong>Core ML</strong>, <strong>TF-Lite</strong>, and <strong>LibTorch</strong>, following the evolution of our machine learning models.",
                "Created custom charts with <strong>Core Graphics</strong> and <strong>Core Animation</strong> and other key app functionalities including push notifications, secure user authentication via <strong>Cognito</strong>, and a customized reminder system using <strong>Core Data</strong> and <strong>EventKit</strong>."
            ],
            "appstore": [
                {
                    "app": "StrAIberry",
                    "link": "https://apps.apple.com/us/app/straiberry/id1590739929",
                    "rating": 5
                }
            ]
        },
        {
            "title": "Urmis - iOS Developer",
            "location": "Tehran, Iran (Remote)",
            "dates": "10/2018 - 10/2020",
            "tasks": [
                "Developed <strong>e-commerce</strong> applications using the <strong>MVVM</strong> architectural pattern and <strong>Test-Driven Development (TDD)</strong> principles, working towards testable code.",
                "Programmatically composed user interfaces with <strong>UIKit</strong> and <strong>AutoLayout</strong>, optimizing for both iPhone and iPad screen sizes.",
                "Identified and resolved performance bottlenecks using <strong>Instruments</strong>, optimizing memory and CPU usage with <strong>Grand Central Dispatch (GCD)</strong> techniques.",
                "Implemented real-time delivery tracking features using <strong>MapKit</strong>, setting both smoothness and energy impact as priorities."
            ],
            "appstore": []
        },
        {
            "title": "Self-Employed - Software Developer",
            "location": "Urmia, Iran",
            "dates": "10/2016 - 02/2018",
            "tasks": [
                "Engaged by six clients to develop and maintain iOS and cross-platform projects across various sectors including education, e-commerce, surveying, and food; utilizing <strong>Swift</strong>, <strong>React Native</strong> and <strong>Flutter</strong>.",
                "Collaborated with clients to understand their needs and translate them into functional and user-friendly features.",
                "Worked with a team of 7 to produce PvP and hypercasual in-house games using <strong>Unity3D</strong>.",
                "Developed and maintained a <strong>Node.js</strong> backend with socket.io and MongoDB, supporting real-time multiplayer game functionality."
            ],
            "appstore": []
        }
    ]
}
